<?php

namespace Database\Seeders;

use App\Models\SingleContent;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SingleContentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        SingleContent::create([
            "about" => "আমাদের লক্ষ্য হচ্ছে অসমাজিক নিরাপত্তাহীনতার বিরুদ্ধে লড়াই করা, যারা প্রয়োজন তাদের জন্য স্বাস্থ্যকর, পুষ্টিকর খাবার সরবরাহের মাধ্যমে। আমরা তাজা, উচ্চ-মানের খাবার সরবরাহ ও বিতরণ করার পাশাপাশি সুষম খাদ্যাভ্যাস এবং স্বাস্থ্যকর জীবনযাপন সম্পর্কে শিক্ষা প্রচারের মাধ্যমে পরিবার ও ব্যক্তিদের সমর্থনে প্রতিশ্রুতিবদ্ধ। সম্প্রদায়িক অংশীদারিত্ব ও দাতব্য অনুদানের মাধ্যমে, আমরা এমন একটি টिकाউ সুস্থ খाद্য নেটওয়ার্ক তৈরি করতে চাই, যা স্বাস্থ্য, সুখ ও সবার জন্য উজ্জ্বল ভবিष्यকে উন্নীত করে।  ক্ষুধার মূল কারণগুলি মোকাবেলা করে, আমরা আমাদের সম্প্রদায়ের উপর স্থায়ী ইতিবাচক প্রভাব ফেলতে এবং অন্যদের আমাদের কারণে যোগ দেওয়ার জন্য অনুপ্রাণিত করার চেষ্টা করি।",
            "mission" => "আমাদের দৃষ্টি হলো একটি এমন সমাজ গঠন করা যেখানে প্রত্যেক ব্যক্তির কাছে পুষ্টিকর ও স্বাস্থ্যকর খাদ্যের সহজলভ্যতা থাকবে। আমরা এমন একটি পৃথিবীর কল্পনা করি যেখানে কেউ খাদ্য অভাবে ভোগবে না এবং প্রত্যেকে সুস্থ জীবনযাপনের সুযোগ পাবে। আমাদের লক্ষ্য হলো খাদ্য সুরক্ষা নিশ্চিত করা, এবং জনগণের মাঝে স্বাস্থ্য সচেতনতা বৃদ্ধি করা। আমরা বিশ্বাস করি যে, একত্রিত প্রচেষ্টার মাধ্যমে আমরা ক্ষুধা নির্মূল করতে এবং একটি সুস্থ ও সুখী সমাজ গঠন করতে সক্ষম হবো।",
            "vision" => "আমাদের লক্ষ্য হলো খাদ্য নিরাপত্তা নিশ্চিত করতে এবং সুস্থ ও পুষ্টিকর খাবারের সহজলভ্যতা প্রদান করতে। আমরা এমন একটি সমাজ গঠন করতে চাই যেখানে প্রত্যেক ব্যক্তি, পরিবার এবং শিশু পর্যাপ্ত পুষ্টিকর খাবার পাবে। আমাদের লক্ষ্যকে বাস্তবায়ন করতে আমরা বিভিন্ন সমাজসেবা প্রকল্প এবং দানকারীদের সহায়তা নিয়ে কাজ করি। আমরা বিশ্বাস করি",
            "goal" => "আমাদের লক্ষ্য হলো খাদ্য নিরাপত্তা নিশ্চিত করতে এবং সুস্থ ও পুষ্টিকর খাবারের সহজলভ্যতা প্রদান করতে। আমরা এমন একটি সমাজ গঠন করতে চাই যেখানে প্রত্যেক ব্যক্তি, পরিবার এবং শিশু পর্যাপ্ত পুষ্টিকর খাবার পাবে। আমাদের লক্ষ্যকে বাস্তবায়ন করতে আমরা বিভিন্ন সমাজসেবা প্রকল্প এবং দানকারীদের সহায়তা নিয়ে কাজ করি। আমরা বিশ্বাস করি",
        ]);
    }
}
